Documents/ЛБ_УстановкаНастроекСозданияНакладныхНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановкаНастроекСозданияНакладныхНаОтгрузку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_НастройкиСозданияНакладныхНаОтгрузку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВыбораДня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОграничениеОценки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеВключениеЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДоступнаОтгрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеньНеделиРасшифровка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВыбораРасшифровка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкиСозданияНакладныхНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкиСозданияНакладныхНаОтгрузку</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядокВыбораДня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокВыбораРасшифровка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньНеделиРасшифровка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОграничениеОценки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеВключениеЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДнейДоступнаОтгрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛБ_УстановкаНастроекСозданияНакладныхНаОтгрузку/Ext/ObjectModule.bsl
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Движения.ЛБ_НастройкиСозданияНакладныхНаОтгрузку.Записывать = Истина;
	Движение = Движения.ЛБ_НастройкиСозданияНакладныхНаОтгрузку.Добавить();
	Движение.Период = Дата;
    Движение.Организация = Организация; 
	Движение.ДеньНедели = ДеньНедели; 
	Если  ДеньНедели = 1 Тогда
		Движение.ДеньНеделиРасшифровка = "понедельник";
	ИначеЕсли  ДеньНедели = 2 Тогда
		Движение.ДеньНеделиРасшифровка = "вторник";
    ИначеЕсли  ДеньНедели = 3 Тогда
		Движение.ДеньНеделиРасшифровка = "среда";
    ИначеЕсли  ДеньНедели = 4 Тогда
		Движение.ДеньНеделиРасшифровка = "черверг";
	ИначеЕсли  ДеньНедели = 5 Тогда
		Движение.ДеньНеделиРасшифровка = "пятница";	
	ИначеЕсли  ДеньНедели = 6 Тогда
		Движение.ДеньНеделиРасшифровка = "суббота";	
	ИначеЕсли  ДеньНедели = 7 Тогда
		Движение.ДеньНеделиРасшифровка = "воскресенье";	
	КонецЕсли;	
	Движение.ЕстьОграничениеОценки = ЕстьОграничениеОценки;	    
	Движение.КоличествоДнейДоступнаОтгрузка = КоличествоДнейДоступнаОтгрузка;
	Движение.ПорядокВыбораДня = ПорядокВыбораДня;
	Если Движение.ПорядокВыбораДня = 0 Тогда
		Движение.ПорядокВыбораРасшифровка = "первый по окончании льготного срока";
	ИначеЕсли Движение.ПорядокВыбораДня = 1 Тогда
		Движение.ПорядокВыбораРасшифровка = "второй по окончании льготного срока";
    ИначеЕсли Движение.ПорядокВыбораДня = 2 Тогда
		Движение.ПорядокВыбораРасшифровка = "третий по окончании льготного срока";
	КонецЕсли;	
	Движение.СообщениеВключениеЗБ = СообщениеВключениеЗБ;
	Движение.СуммаОценки = СуммаОценки;
КонецПроцедуры	

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если ЛБ_УправлениеЛомбардом.ЕстьНакладныеНаОтгрузу(ЭтотОбъект.Ссылка) Тогда
		ОбщегоНазначения.СообщитьПользователю("По этому документу есть созданные накладные! Отмена проведения документа запрещена.");
		Отказ = Истина;
    КонецЕсли;
КонецПроцедуры   

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если ПометкаУдаления Тогда
        Если ЛБ_УправлениеЛомбардом.ЕстьНакладныеНаОтгрузу(ЭтотОбъект.Ссылка) Тогда
			ОбщегоНазначения.СообщитьПользователю("По этому документу есть созданные накладные! Удаление документа запрещено.");
			Отказ = Истина;
		КонецЕсли; 
	КонецЕсли;	
КонецПроцедуры
